In [1]:
import numpy as np
import pandas as pd

In [2]:
index = [(1, 'A'), (2, 'A'), (1, 'B'), (2, 'B')]
s1 = pd.Series([1.0, 2.0, 3.0, 4.0], index=index)

In [3]:
s1

(1, A)    1.0
(2, A)    2.0
(1, B)    3.0
(2, B)    4.0
dtype: float64

In [5]:
s1[[i for i in s1.index if i[1] == 'A']]

(1, A)    1.0
(2, A)    2.0
dtype: float64

In [6]:
new_index = pd.MultiIndex.from_tuples(index)
new_index

MultiIndex([(1, 'A'),
            (2, 'A'),
            (1, 'B'),
            (2, 'B')],
           )

In [8]:
s1 = s1.reindex(new_index)
s1

1  A    1.0
2  A    2.0
1  B    3.0
2  B    4.0
dtype: float64

In [9]:
s1[1]

A    1.0
B    3.0
dtype: float64

In [10]:
s1[:, 'A']

1    1.0
2    2.0
dtype: float64

In [12]:
s1_df = s1.unstack()
s1_df

     A    B
1  1.0  3.0
2  2.0  4.0

In [13]:
s1_df.stack()

1  A    1.0
   B    3.0
2  A    2.0
   B    4.0
dtype: float64

In [15]:
s1_df = pd.DataFrame({'data1': s1, 'data2': [5.0, 6.0, 7.0, 8.0]})

In [16]:
s1_df

     data1  data2
1 A    1.0    5.0
2 A    2.0    6.0
1 B    3.0    7.0
2 B    4.0    8.0

In [18]:
x = s1_df['data1'] + s1_df['data2']
x

1  A     6.0
2  A     8.0
1  B    10.0
2  B    12.0
dtype: float64

In [19]:
x.unstack()

     A     B
1  6.0  10.0
2  8.0  12.0

In [20]:
x

1  A     6.0
2  A     8.0
1  B    10.0
2  B    12.0
dtype: float64

In [21]:
s1_df['sum'] = x
s1_df

     data1  data2   sum
1 A    1.0    5.0   6.0
2 A    2.0    6.0   8.0
1 B    3.0    7.0  10.0
2 B    4.0    8.0  12.0

In [22]:
pd.DataFrame(np.random.rand(4,2),
             index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]],
             columns=['data1', 'data2'])

        data1     data2
a 1  0.914513  0.966956
  2  0.981798  0.831548
b 1  0.050684  0.217697
  2  0.224284  0.811648

In [23]:
data = {('California', 2000): 33871648,
        ('California', 2010): 37253956,
        ('Texas', 2000): 20851820,
        ('Texas', 2010): 25145561,
        ('New York', 2000): 18976457,
        ('New York', 2010): 19378102}
s2 = pd.Series(data)

In [24]:
s2

California  2000    33871648
            2010    37253956
Texas       2000    20851820
            2010    25145561
New York    2000    18976457
            2010    19378102
dtype: int64

In [25]:
s2[:, 2000]

California    33871648
Texas         20851820
New York      18976457
dtype: int64

In [26]:
pd.MultiIndex.from_arrays([['A', 'A', 'B', 'B'], [1, 2, 1, 2]])

MultiIndex([('A', 1),
            ('A', 2),
            ('B', 1),
            ('B', 2)],
           )

In [35]:
pd.MultiIndex.from_product([['A', 'B'], [1, 2]], names=['one', 'two'])

MultiIndex([('A', 1),
            ('A', 2),
            ('B', 1),
            ('B', 2)],
           names=['one', 'two'])

In [28]:
s1

1  A    1.0
2  A    2.0
1  B    3.0
2  B    4.0
dtype: float64

In [29]:
s1.index.names = ['one', 'two']

In [30]:
s1

one  two
1    A      1.0
2    A      2.0
1    B      3.0
2    B      4.0
dtype: float64

In [31]:
s2

California  2000    33871648
            2010    37253956
Texas       2000    20851820
            2010    25145561
New York    2000    18976457
            2010    19378102
dtype: int64

In [32]:
s2.index.names = ['States', 'Year']

In [33]:
s2.index

MultiIndex([('California', 2000),
            ('California', 2010),
            (     'Texas', 2000),
            (     'Texas', 2010),
            (  'New York', 2000),
            (  'New York', 2010)],
           names=['States', 'Year'])

In [36]:
index = pd.MultiIndex.from_product([[2013, 2014], [1, 2]],
                                   names=['year', 'visit'])
columns = pd.MultiIndex.from_product([['Bob', 'Guido', 'Sue'], ['HR', 'Temp']],
                                     names=['subject', 'type'])

In [37]:
data = np.round(np.random.randn(4, 6), 1)
data[:, ::2] -= 10
data += 37

In [38]:
health_data = pd.DataFrame(data, index=index, columns=columns)
health_data

subject      Bob       Guido         Sue
type          HR  Temp    HR  Temp    HR  Temp
year visit
2013 1      27.2  37.0  25.9  36.9  27.8  37.2
     2      28.2  37.3  26.8  38.0  28.0  37.1
2014 1      26.9  37.3  25.9  37.9  26.3  38.2
     2      27.3  37.5  26.4  37.5  26.1  34.9

In [43]:
health_data['Bob']

type          HR  Temp
year visit
2013 1      27.2  37.0
     2      28.2  37.3
2014 1      26.9  37.3
     2      27.3  37.5

In [45]:
health_data.loc[2013]['Bob']

type     HR  Temp
visit
1      27.2  37.0
2      28.2  37.3